math251/one_one.tex
% Created 2024-08-21 Wed 09:48
% Intended LaTeX compiler: pdflatex
\documentclass[letterpaper, 12pt]{article}
                                \usepackage{lmodern} % Ensures we have the right font
\usepackage[T1]{fontenc}
\usepackage[utf8]{inputenc}
\usepackage{graphicx}
\usepackage{amsmath, amsthm, amssymb}
\usepackage[table, xcdraw]{xcolor}
\usepackage{hanging}
\definecolor{bblue}{HTML}{0645AD}
\usepackage[colorlinks]{hyperref}
\hypersetup{colorlinks, linkcolor=blue, urlcolor=bblue}
\usepackage{titling}
\setlength{\droptitle}{-6em}
\setlength{\parindent}{0pt}
\setlength{\parskip}{0em}
\usepackage[stretch=10]{microtype}
\usepackage{hyphenat}
\usepackage{ragged2e}
\usepackage{subfig} % Subfigures (not needed in Org I think)
\usepackage{hyperref} % Links
\usepackage{listings} % Code highlighting
\usepackage[top=0.85in, bottom=0.85in, left=0.85in, right=0.85in]{geometry}
\renewcommand{\baselinestretch}{1.00}
\usepackage[explicit]{titlesec}
\pretitle{\begin{center}\fontsize{20pt}{20pt}\selectfont}
\posttitle{\par\end{center}}
\preauthor{\begin{center}\vspace{-6bp}\fontsize{14pt}{14pt}\selectfont}
\postauthor{\par\end{center}\vspace{-25bp}}
\predate{\begin{center}\fontsize{12pt}{12pt}\selectfont}
\postdate{\par\end{center}\vspace{0em}}
\titlespacing\section{0pt}{5pt}{5pt} % left margin, space before section header, space after section header
\titlespacing\subsection{0pt}{5pt}{-2pt} % left margin, space before subsection header, space after subsection header
\titlespacing\subsubsection{0pt}{5pt}{-2pt} % left margin, space before subsection header, space after subsection header
\usepackage{enumitem}
\setlist{itemsep=-2pt} % or \setlist{noitemsep} to leave space around whole list
\usepackage{listings}
\date{\today}
\title{One One}
\hypersetup{
 pdfauthor={},
 pdftitle={One One},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.4 (Org mode 9.8)}, 
 pdflang={English}}
\begin{document}

\maketitle
\section{Objectives}
\label{sec:orge4c3ff0}
\begin{itemize}
\item Given a system of linear equations, identify if the system has, 0, 1 or infinte solutions\\
\item Given a system of linear equations, identify if the system is a homogenous system\\
\item Transform Systems of linear equations into augmented coefficient matricies\\
\item Solve systems of linear equations using Gauss-Jordan reduction\\
\item Translate the reduced row echelon form of the matrix to a solution to the system\\
\end{itemize}
\section{Systems of Equations => Matricies}
\label{sec:org3f3e86a}
We can represent the system of equations\\

\begin{matrix}
5x+y=3\\
2x-y=4
\end{matrix}

\begin{array}{cc|c}
5 & 1 & 3 \\
2 & -1 & 4
\end{array}

\left(\\
\begin{array}{ccc}
1 & 0 & 3\\
1 & 0 & 3
\end{array}
\right)\\
\section{Review of SOE}
\label{sec:orgfae76ad}
Recall that 2D is represented as \(ay + by = c\), where (a != 0 and b != 0)\\
and 3D is represented as \(ay + by + cz = d\), once again (a,b,c != 0)\\

We can define a more general form\\
\[
a_{}x_{1} + a_{2}x_{2} + ... + a_{n}x_{n} = b
\]\\

where a\textsubscript{1}, a\textsubscript{2},\ldots{},a\textsubscript{n} and b are real constants\\
\subsection{Examples}
\label{sec:orgc1f4699}
\(x + 3y = 7\)\\
\(x_{1}-2x_{2}-3x_{3}+x_{4}=0\)\\
\(\frac{1}{2}x-y+3z=-1\)\\
\(x_{1}+x_{2}+...+x_{n}=1\)\\
\subsection{Non-examples}
\label{sec:orge18a308}
\(x+3y^{2}=4\)\\
\(3x+2y-xy=5\)\\
\(sinx+y=0\)\\
\(\sqrt{x_{1}}+2x_{2}+x_{3}=1\)\\
\subsection{Terminology}
\label{sec:orgac91acd}
We call these finite sets of linear equations a \textbf{linear system}, where the variables are called \textbf{unknowns}.\\

A general linear system of m equations in the n unknowns x\textsubscript{1},x\textsubscript{2},\ldots{},x\textsubscript{n} can be written as\\

\begin{matrix}
a_{11}x_{1} + a_{12}x_{2} + ... + a_{1n}x_{n} = b1\\
a_{21}x_{1} + a_{22}x_{2} + ... + a_{2n}x_{n} = b2\\
...\\
a_{m1}x_{1} + a_{m2}x_{2} + ... + a_{mn}x_{n} = bm\\
\end{matrix}

A solution of a linear system in n unknowns x\textsubscript{1,x}\textsubscript{2,\ldots{},x}\textsubscript{n} is a sequence of n numbers s\textsubscript{1,s}\textsubscript{2,\ldots{},s}\textsubscript{n} for which the substitution\\
\[x_1 = s_1, x_2 = s_2, ..., x_n = s_n\]\\
makes each equation a true statement. Generally we could write solutions as\\
\[(s_1,s_2,...,s_n\]\\
which as called an ordered n-tuple. With this notation it is understood that all variables appear in the same order in each equation. If n = 2, then the n-tuple is called an \textbf{ordered pair}, and if n = 3, then it is called an \textbf{ordered triple}.\\
\subsection{Solve the Systems:}
\label{sec:org6add426}
In linear algebra we mostly focus on elimination method\\
\subsubsection{1.}
\label{sec:orgb95f955}
\begin{matrix}
x & + & y & = & 10 & (1))\\
3x & + & y & = & 18 & (2)
\end{matrix}

\((1)-(2)\)\\
\(-2x = -8\)\\
\(3x + y = 18\)\\

\(x=4\)\\
\(3(4) + y = 18\)\\

\(x = 4\)\\
\(y = 6\)\\

\((4,6)\)\\
\subsubsection{2.}
\label{sec:orgd11b2c1}
\begin{matrix}
x & + & y & = & 10\\
3x & + & 3y & = & 30
\end{matrix}
\subsubsection{3.}
\label{sec:org1477f2a}
\begin{matrix}
x & + & y & = & 10\\
3x & + & 3y & = & 18
\end{matrix}
\subsubsection{4.}
\label{sec:org8302c2a}
\begin{matrix}
x & + & y & = & 0\\
4x & + & 5y & = & 0
\end{matrix}
\subsection{Solutions to Linear Systems}
\label{sec:orgb5aec96}
\begin{center}
\begin{tabular}{ll}
\# of solutions & title\\
\hline
at least one & consistent\\
no solutions & inconsistent\\
\(\inf\) & dependent\\
all solutions 0 & homogenous\\
\end{tabular}
\end{center}
\subsection{How to Write out Systems}
\label{sec:org4b8dbf4}
\begin{matrix}
a_{11}x_{1} + a_{12}x_{2} + ... + a_{1n}x_{n} = b1\\
a_{21}x_{1} + a_{22}x_{2} + ... + a_{2n}x_{n} = b2\\
...\\
a_{m1}x_{1} + a_{m2}x_{2} + ... + a_{mn}x_{n} = bm\\
\end{matrix}

\left (\\
\begin{array}{cccc|c}
v1 & v2 \
a_{11} & a_{12} & ... & a_{1n} & b_1\\
a_{21} & a_{22} & ... & a_{2n} & b_2\\
...\\
a_{m1} & a_{m2} & ... & a_{mn} & b_m
\end{array}
\right )\\

This is called the augmented matrix for the system\\
\subsubsection{Example from College Algebra}
\label{sec:org430276f}
\left (\\
\begin{array}{cccc|c}
x_1 & + & 2x_2 & = & 16\\
2x_4 & + & 3x_2 & = & 16
\end{array}
\right )\\

Check if (2,4) is a solution\\
\subsubsection{Example 1 Show the Augmented Matrix}
\label{sec:org2ccad0a}
\begin{bmatrix}
1 & 1 & 2 & | & 9\\
2 & 4 & -3 & | & 1\\
3 & 6 & -5 & | & 0
\end{bmatrix}

We have to rewrite equations if needed before writing out the corresponding augmented matrix\\

\begin{Bmatrix}
x_1 & + & 2x_2 & = & 3\\
3x_2 & + & x_1 & = & 1
\end{Bmatrix}

Move x\textsubscript{1} and x\textsubscript{2} to line up with each other, forming\ldots{}\\

\begin{bmatrix}
1 & 2 & | & 3\\
1 & 3 & | & 1
\end{bmatrix}
\subsection{How to Solve a Sytem Using Matricies}
\label{sec:orgdc52df4}
We need to perform operations on the system that do not alter the solution set and that produce a succession of increasingly simpler systems, until a point is reached where is can ascertained whether the system is consistent, and if so, what its solutions are.\\
\subsubsection{Common Steps}
\label{sec:orgfc27146}
\begin{enumerate}
\item Multiply an equation through by a by a nonzero constant\\
\item Interchange two equations\\
\item Add a constant times one equation to another\\
\begin{itemize}
\item Adding or subtracting\\
\item 3 - 4 = (3 + -4)\\
\end{itemize}
\end{enumerate}

Since the rows of an augmented matrix correspond to the equation in the associated system, these t3 operations correspond to the following operations on the rows of an augmented matrix\\
\begin{enumerate}
\item Multiply a row through by a nonzero constant\\
\item Interchange two rows\\
\item Add a constant time one row to another\\
\end{enumerate}

These are called elementary row operations on a matrix\\
\begin{enumerate}
\item Example 2
\label{sec:org04f1ba8}
Solve the following by starting with an augmented coefficent matrix\\

\begin{matrix}
x & + & 4y & = & 19\\
3x & + & y & = & 2
\end{matrix}

\left (\\
\begin{array}{cc|c}
1 & 4 & 19\\
3 & 1 & 2
\end{array}
\right )\\

How to solve the problem?\\
\(R_2 - 3R_1 \rightarrow{} R_2\)\\

3R\textsubscript{1}:\\
{[}3 12 57]\\

\left (\\
\begin{array}{cc|c}
1 & 4 & 19\\
0 & -11 & -55
\end{array}
\right )\\

\(-11y = -55\)\\
\(y = 5\)\\

\(x + 4(5) = 19\)\\
\(x = -1\)\\

\((-1, 5)\)\\

\[
5x + 4\\
= 2x+3
\]\\
\item Example 3
\label{sec:org5293e56}

\begin{matrix}
x & + & y & + & 2z & = & 9\\
2x & + & 4y & - & 3z & = & 1\\
3x & + & 6y & - & 5z & = & 0
\end{matrix}
\end{enumerate}
\end{document}
